#Warn
;=====================================================================o
;
;
;  ▄████▄   ▄▄▄       ██▓███    ██████  ██▓     ▒█████   ▄████▄   ██ ▄█▀
; ▒██▀ ▀█  ▒████▄    ▓██░  ██▒▒██    ▒ ▓██▒    ▒██▒  ██▒▒██▀ ▀█   ██▄█▒
; ▒▓█    ▄ ▒██  ▀█▄  ▓██░ ██▓▒░ ▓██▄   ▒██░    ▒██░  ██▒▒▓█    ▄ ▓███▄░
; ▒▓▓▄ ▄██▒░██▄▄▄▄██ ▒██▄█▓▒ ▒  ▒   ██▒▒██░    ▒██   ██░▒▓▓▄ ▄██▒▓██ █▄
; ▒ ▓███▀ ░ ▓█   ▓██▒▒██▒ ░  ░▒██████▒▒░██████▒░ ████▓▒░▒ ▓███▀ ░▒██▒ █▄
; ░ ░▒ ▒  ░ ▒▒   ▓▒█░▒▓▒░ ░  ░▒ ▒▓▒ ▒ ░░ ▒░▓  ░░ ▒░▒░▒░ ░ ░▒ ▒  ░▒ ▒▒ ▓▒
;   ░  ▒     ▒   ▒▒ ░░▒ ░     ░ ░▒  ░ ░░ ░ ▒  ░  ░ ▒ ▒░   ░  ▒   ░ ░▒ ▒░
; ░          ░   ▒   ░░       ░  ░  ░    ░ ░   ░ ░ ░ ▒  ░        ░ ░░ ░
; ░ ░            ░  ░               ░      ░  ░    ░ ░  ░ ░      ░  ░
; ░                                                     ░
;
;                                                        Author: miozus
;                                                        Modified: Sentixxxxx
;                                       AHK version: thqby/AutoHotkey_H




;=====================================================================o
;                       CapsLock Global Setting
;
; 我的键盘布局 (HHKB ¯‗¯‗‗‗) ，其实任意键盘都兼容适配
;
; ,-----------------------------------------------------------.
; |Esc|  1|  2|  3|  4|  5|  6|  7|  8|  9|  0|  -|  =| \| `  |
; |-----------------------------------------------------------|
; |Tab  |  Q|  W|  E|  R|  T|  Y|  U|  I|  O|  P|  [|  ]|BackS|
; |-----------------------------------------------------------|
; |Caps  |  A|  S|  D|  F|  G|  H|  J|  K|  L|  ;|  '| Return |
; |-----------------------------------------------------------|
; |Shift   |  Z|  X|  C|  V|  B|  N|  M|  ,|  .|  /|Shift |Fn |
; |-----------------------------------------------------------|
; |    |Alt |Ctrl  |         Space         |Win  |Alt |       |
; `-----------------------------------------------------------'
;
;
SendMode "Input"             ; 速度快
SetWorkingDir A_ScriptDir    ; 当前脚本目录，就是脚本运行目录
InstallKeybdHook             ; 无条件安装键盘钩子,防止丢失
DetectHiddenWindows True     ; 虚拟桌面：打开检测隐藏窗口，自动跳转桌面
;
; 全局配置开始 =============
;
;=====================================================================o
;                       CapsLock init

; 热键钩子注册中心
allHotkeys := []
allHotkeys.Push("*;")
allHotkeys.Push("*3")
allHotkeys.Push("*4")

; 用户数据 ============================
#Include data\Application.ahk
; 公共组件 ============================
#Include bin\common\Common.ahk
; 增强插件 ============================
#Include bin\CapsLockEnhancement.ahk
#Include bin\Navigator.ahk
#Include bin\SemicolonHook.ahk
#Include bin\Window.ahk
#Include bin\Apps.ahk
; 拓展键盘 ============================
#Include bin\plugin\GarbageKB.ahk

; 全局配置结束 ===========

; y = why | reload script 脚本暂停标记，至少留一组快捷键控制脚本重启，激活最新改动版本
#SuspendExempt

CapsLock & y:: Reload
